oblastMap = {
    "город Астана": {
        "value": "2",
        "sudebnieOrgany": {
            "Специализированный межрайонный экономический суд города Астаны (Гражданские дела (ч.1 ст.27 ГПК))": "7",
            "Специализированный межрайонный суд по делам несовершеннолетних города Астаны (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КоАП РК))": "9",
            "Межрайонный суд по гражданским делам города Астаны": "489"
        }
    },
    "город Алматы": {
        "value": "3",
        "sudebnieOrgany": {
            "Бостандыкский районный суд города Алматы (Гражданские дела)": "16",
            "Жетысуский районный суд города Алматы (Гражданские дела)": "17",
            "Медеуский районный суд города Алматы (Гражданские дела)": "18",
            "Турксибский районный суд города Алматы (Гражданские, уголовные дела)": "19",
            "Районный суд №2 Алмалинского района города Алматы (Гражданские дела)": "20",
            "Специализированный межрайонный экономический суд города Алматы (Гражданские дела (ч.1 ст.27 ГПК))": "21",
            "Специализированный межрайонный суд по делам несовершеннолетних города Алматы (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КоАП РК))": "23",
            "Районный суд №2 Ауэзовского района города Алматы (Гражданские дела)": "24",
            "Алатауский районный суд города Алматы (Гражданские, уголовные дела)": "27",
            "Наурызбайский районный суд города Алматы (Гражданские, уголовные дела)": "380"
        }
    },
    "город Шымкент": {
        "value": "19",
        "sudebnieOrgany": {
            "Межрайонный суд по гражданским делам города Шымкента": "491",
            "Специализированный межрайонный экономический суд города Шымкента (Гражданские дела (ч.1 ст.27 ГПК))": "386",
            "Специализированный межрайонный суд по делам несовершеннолетних города Шымкента (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП)": "384"
        }
    },
    "Акмолинская область": {
        "value": "4",
        "sudebnieOrgany": {
            "Кокшетауский городской суд Акмолинской области (Гражданские, уголовные дела)": "30",
            "Специализированный межрайонный экономический суд Акмолинской области (Гражданские дела (ч.1 ст.27 ГПК))": "32",
            "Степногорский городской суд Акмолинской области (Общая юрисдикция)": "33",
            "Суд города Косшы Акмолинской области (Общей юрисдикции)": "434",
            "Аккольский районный суд Акмолинской области (Общая юрисдикция)": "34",
            "Аршалынский районный суд Акмолинской области (Общая юрисдикция)": "35",
            "Астраханский районный суд Акмолинской области (Общая юрисдикция)": "36",
            "Атбасарский районный суд Акмолинской области (Общая юрисдикция)": "37",
            "Буландынский районный суд Акмолинской области (Общая юрисдикция)": "38",
            "Егиндыкольский районный суд Акмолинской области (Общая юрисдикция)": "39",
            "Суд района Биржан сал, Акмолинской области (Общая юрисдикция)": "40",
            "Ерейментауский районный суд Акмолинской области (Общая юрисдикция)": "41",
            "Есильский районный суд Акмолинской области (Общая юрисдикция)": "42",
            "Жаксынский районный суд Акмолинской области (Общая юрисдикция)": "43",
            "Жаркаинский районный суд Акмолинской области (Общая юрисдикция)": "45",
            "Зерендинский районный суд Акмолинской области (Общая юрисдикция)": "46",
            "Коргалжынский районный суд Акмолинской области (Общая юрисдикция)": "47",
            "Сандыктауский районный суд Акмолинской области (Общая юрисдикция)": "48",
            "Целиноградский районный суд Акмолинской области (Общая юрисдикция)": "49",
            "Шортандинский районный суд Акмолинской области (Общая юрисдикция)": "50",
            "Бурабайский районный суд Акмолинской области (Общая юрисдикция)": "51",
            "Специализированный межрайонный суд по делам несовершеннолетних Акмолинской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КоАП РК))": "53"
        }
    },
    "Актюбинская область": {
        "value": "5",
        "sudebnieOrgany": {
            'Суд города Актобе Актюбинской области, район "Астана" (Гражданские дела)': "56",
            "Специализированный межрайонный экономический суд Актюбинской области (Гражданские дела (ч.1 ст.27 ГПК))": "59",
            'Суд № 3 города Актобе Актюбинской области, район "Алматы" (Гражданские дела)': "389",
            "Алгинский районный суд Актюбинской области (Общая юрисдикция)": "60",
            "Айтекебийский районный суд Актюбинской области (Общая юрисдикция)": "61",
            "Байганинский районный суд Актюбинской области (Общая юрисдикция)": "62",
            "Каргалинский районный суд Актюбинской области (Общая юрисдикция)": "63",
            "Кобдинский районный суд Актюбинской области (Общая юрисдикция)": "64",
            "Мартукский районный суд Актюбинской области (Общая юрисдикция)": "65",
            "Мугалжарский районный суд Актюбинской области (Общая юрисдикция)": "66",
            "Уилский районный суд Актюбинской области (Общая юрисдикция)": "68",
            "Темирский районный суд Актюбинской области  (Общая юрисдикция)": "69",
            "Хромтауский районный суд Актюбинской области (Общая юрисдикция)": "70",
            "Шалкарский районный суд Актюбинской области (Общая юрисдикция)": "71",
            "Иргизский районный суд Актюбинской области (Общая юрисдикция)": "72",
            "Специализированный межрайонный суд по делам несовершеннолетних Актюбинской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КоАП РК))": "73"
        }
    },
    "Алматинская область": {
        "value": "6",
        "sudebnieOrgany": {
            "Специализированный межрайонный экономический суд Алматинской области (Гражданские дела (ч.1 ст.27 ГПК))": "78",
            "Суд города Қонаев Алматинской области (Общая юрисдикция)": "79",
            "Суд города Алатау": "492",
            "Балхашский районный суд Алматинской области (Общая юрисдикция)": "84",
            "Енбекшиказахский районный суд Алматинской области (Общая юрисдикция)": "85",
            "Районный суд №2 Енбекшиказахского района Алматинской области (Общая юрисдикция)": "86",
            "Жамбылский районный суд Алматинской области (Общая юрисдикция)": "87",
            "Карасайский районный суд Алматинской области (Гражданские, уголовные дела)": "92",
            "Кегенский районный суд Алматинской области (Общая юрисдикция)": "95",
            "Райымбекский районный суд Алматинской области (Общая юрисдикция)": "96",
            "Талгарский районный суд Алматинской области (Общая юрисдикция)": "98",
            "Уйгурский районный суд Алматинской области (Общая юрисдикция)": "100",
            "Илийский районный суд Алматинской области (Общая юрисдикция)": "101",
            "Специализированный межрайонный суд по делам несовершеннолетних Алматинской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "102"
        }
    },
    "Атырауская область": {
        "value": "7",
        "sudebnieOrgany": {
            "Специализированный межрайонный экономический суд Атырауской области (Гражданские дела (ч.1 ст.27 ГПК))": "106",
            "Атырауский городской суд Атырауской области (Гражданские дела)": "107",
            "Жылыойский районный суд Атырауской области (Общая юрисдикция)": "110",
            "Индерский районный суд Атырауской области (Общая юрисдикция)": "111",
            "Исатайский районный суд Атырауской области (Общая юрисдикция)": "112",
            "Курмангазинский районный суд Атырауской области (Общая юрисдикция)": "113",
            "Кызылкогинский районный суд Атырауской области (Общая юрисдикция)": "114",
            "Макатский районный суд Атырауской области (Общая юрисдикция)": "115",
            "Махамбетский районный суд Атырауской области (Общая юрисдикция)": "116",
            "Специализированный межрайонный суд по делам несовершеннолетних Атырауской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "117",
        }
    },
    "Восточно-Казахстанская область": {
        "value": "8",
        "sudebnieOrgany": {
            "Специализированный межрайонный экономический суд Восточно-Казахстанской области (Гражданские дела (ч.1 ст.27 ГПК))": "120",
            "Усть-Каменогорский городской суд Восточно-Казахстанской области (Гражданские дела)": "121",
            "Риддерский городской суд Восточно-Казахстанской области (Гражданские, уголовные дела)": "125",
            "Глубоковский районный суд Восточно-Казахстанской области (Общая юрисдикция)": "134",
            "Зайсанский районный суд Восточно-Казахстанской области (Общая юрисдикция)": "137",
            "Суд района Алтай Восточно-Казахстанской области (Общая юрисдикция)": "138",
            "Районный суд №2 района Алтай Восточно-Казахстанской области (Общая юрисдикция)": "139",
            "Районный суд района Самар Восточно-Казахстанской области (Общая юрисдикция)": "141",
            "Курчумский районный суд Восточно-Казахстанской области (Общая юрисдикция)": "142",
            "Суд района Марқакөл": "493",
            "Катон-Карагайский районный суд Восточно-Казахстанской области (Общая юрисдикция)": "144",
            "Тарбагатайский районный суд Восточно-Казахстанской области (Общая юрисдикция)": "147",
            "Специализированный межрайонный суд по делам несовершеннолетних Восточно-Казахстанской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "149",
            "Уланский районный суд Восточно-Казахстанской области (Общая юрисдикция)": "150",
            "Шемонаихинский районный суд Восточно-Казахстанской области (Общая юрисдикция)": "154",
            "Суд района Үлкен Нарын": "494"
        }
    },
    "Жамбылская область": {
        "value": "9",
        "sudebnieOrgany": {
            "Таразский городской суд Жамбылской области (Гражданские дела)": "159",
            "Специализированный межрайонный экономический суд Жамбылской области (Гражданские дела (ч.1 ст.27 ГПК))": "161",
            "Байзакский районный суд Жамбылской области (Общая юрисдикция)": "163",
            "Жамбылский районный суд Жамбылской области (Общая юрисдикция)": "164",
            "Жуалынский районный суд Жамбылской области (Общая юрисдикция)": "165",
            "Кордайский районный суд Жамбылской области (Общая юрисдикция)": "166",
            "Суд района имени Турара Рыскулова Жамбылской области (Общая юрисдикция)": "167",
            "Меркенский районный суд Жамбылской области (Общая юрисдикция)": "168",
            "Мойынкумский районный суд Жамбылской области (Общая юрисдикция)": "169",
            "Сарысуский районный суд Жамбылской области (Общая юрисдикция)": "170",
            "Таласский районный суд Жамбылской области (Общая юрисдикция)": "171",
            "Шуский районный суд Жамбылской области (Общая юрисдикция)": "172",
            "Специализированный межрайонный суд по делам несовершеннолетних Жамбылской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП)": "173"
        }
    },
    "Западно-Казахстанская область": {
        "value": "10",
        "sudebnieOrgany": {
            "Суд №2 города Уральска  Западно-Казахстанской области (Гражданские дела)": "177",
            "Специализированный межрайонный экономический суд Западно-Казахстанской области (Гражданские дела (ч.1 ст.27 ГПК))": "179",
            "Акжаикский районный суд Западно-Казахстанской области (Общая юрисдикция)": "180",
            "Районный суд №2 Акжаикского района  Западно-Казахстанской области (Общая юрисдикция)": "181",
            "Бурлинский районный суд  Западно-Казахстанской области (Общая юрисдикция)": "182",
            "Жангалинский районный суд Западно-Казахстанской области (Общая юрисдикция)": "184",
            "Жаныбекский районный суд Западно-Казахстанской области (Общая юрисдикция)": "185",
            "Суд района Бәйтерек Западно-Казахстанской области (Общая юрисдикция)": "186",
            "Суд №2 района Бәйтерек Западно-Казахстанской области (Общая юрисдикция)": "187",
            "Казталовскии районный суд Западно-Казахстанской области (Общая юрисдикция)": "188",
            "Каратобинский районный суд Западно-Казахстанской области (Общая юрисдикция)": "190",
            "Бокейординский районный суд Западно-Казахстанской области (Общая юрисдикция)": "191",
            "Сырымский районный суд Западно-Казахстанской области (Общая юрисдикция)": "192",
            "Таскалинский районный суд Западно-Казахстанской области (Общая юрисдикция)": "193",
            "Теректинский районный суд Западно-Казахстанской области (Общая юрисдикция)": "194",
            "Чингирлауский районный суд Западно-Казахстанской области (Общая юрисдикция)": "196",
            "Специализированный межрайонный суд по делам несовершеннолетних Западно-Казахстанской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "197"
        }
    },
    "Карагандинская область": {
        "value": "11",
        "sudebnieOrgany": {
            "Районный суд №2 Казыбекбийского района города Караганды Карагандинской области (Гражданские дела)": "201",
            "Специализированный межрайонный экономический суд Карагандинской области (Гражданские дела (ч.1 ст.27 ГПК))": "202",
            "Балхашский городской суд Карагандинской области (Гражданские, уголовные дела)": "203",
            "Приозерский городской суд Карагандинской области (Общая юрисдикция)": "206",
            "Саранский городской суд Карагандинской области (Общая юрисдикция)": "207",
            "Темиртауский городской суд Карагандинской области (Гражданские, уголовные дела)": "209",
            "Шахтинский городской суд Карагандинской области (Общая юрисдикция)": "210",
            "Абайский районный суд Карагандинской области (Общая юрисдикция)": "211",
            "Актогайский районный суд Карагандинской области (Общая юрисдикция)": "213",
            "Бухар-Жырауский районный суд Карагандинской области (Общая юрисдикция)": "215",
            "Районный суд №2 Бухар-Жырауского  района Карагандинской области (Общая юрисдикция)": "216",
            "Каркаралинский районный суд Карагандинской области (Общая юрисдикция)": "218",
            "Нуринский районный суд Карагандинской области (Общая юрисдикция)": "220",
            "Осакаровский районный суд Карагандинской области (Общая юрисдикция)": "221",
            "Шетский районный суд Карагандинской области (Общая юрисдикция)": "225",
            "Районный суд №2 Шетского района Карагандинской области (Общая юрисдикция)": "226",
            "Суд района Әлихан Бөкейхан города Караганды Карагандинской области (Гражданские, уголовные дела)": "227",
            "Cуд №2 района Әлихан Бөкейхан города Караганды Карагандинской области (Гражданские, уголовные дела)": "228",
            "Специализированный межрайонный суд по делам несовершеннолетних Карагандинской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "235"
        }
    },
    "Костанайская область": {
        "value": "12",
        "sudebnieOrgany": {
            "Костанайский городской суд Костанайской области (Гражданские дела)": "238",
            "Аркалыкский городской суд Костанайской области (Общая юрисдикция)": "240",
            "Лисаковский городской суд Костанайской области (Общая юрисдикция)": "241",
            "Рудненский городской суд Костанайской области (Гражданские, уголовные дела)": "242",
            "Амангельдинский районный суд Костанайской области (Общая юрисдикция)": "247",
            "Аулиекольский районный суд Костанайской области (Общая юрисдикция)": "248",
            "Денисовский районный суд Костанайской области (Общая юрисдикция)": "249",
            "Жангельдинский районный суд Костанайской области (Общая юрисдикция)": "250",
            "Житикаринский районный суд Костанайской области (Общая юрисдикция)": "251",
            "Камыстинский районный суд Костанайской области (Общая юрисдикция)": "252",
            "Карабалыкский районный суд Костанайской области (Общая юрисдикция)": "253",
            "Карасуский районный суд Костанайской области (Общая юрисдикция)": "254",
            "Костанайский межрайонный суд Костанайской области ": "256",
            "Мендыкаринский районный суд Костанайской области (Общая юрисдикция)": "257",
            "Наурзумский районный суд Костанайской области (Общая юрисдикция)": "258",
            "Сарыкольский районный суд Костанайской области (Общая юрисдикция)": "259",
            "Суд района Беимбета Майлина Костанайской области (Общая юрисдикция)": "260",
            "Узункольский районный суд Костанайской области (Общая юрисдикция)": "261",
            "Федоровский районный суд Костанайской области (Общая юрисдикция)": "262",
            "Специализированный межрайонный экономический суд Костанайской области (Гражданские дела (ч.1 ст.27 ГПК))": "263",
            "Специализированный межрайонный суд по делам несовершеннолетних Костанайской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "264"
        }
    },
    "Кызылординская область": {
        "value": "13",
        "sudebnieOrgany": {
            "Кызылординский городской суд Кызылординской области (Гражданские дела)": "267",
            "Аральский районный суд Кызылординской области (Общая юрисдикция)": "268",
            "Жалагашский районный суд Кызылординской области (Общая юрисдикция)": "269",
            "Жанакорганский районный суд Кызылординской области (Общая юрисдикция)": "270",
            "Казалинский районный суд Кызылординской области (Общая юрисдикция)": "271",
            "Кармакшинский районный суд Кызылординской области (Общая юрисдикция)": "272",
            "Сырдарьинский районный суд Кызылординской области (Общая юрисдикция)": "273",
            "Шиелийский районный суд Кызылординской области (Общая юрисдикция)": "274",
            "Байконырский городской суд Кызылординской области (Общая юрисдикция)": "275",
            "Специализированный межрайонный экономический суд Кызылординской области (Гражданские дела (ч.1 ст.27 ГПК))": "278",
            "Специализированный межрайонный суд по делам несовершеннолетних Кызылординской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "279"
        }
    },
    "Мангистауская область": {
        "value": "14",
        "sudebnieOrgany": {
            "Суд №2 города Актау Мангистауской области (Гражданские дела)": "283",
            "Специализированный межрайонный экономический суд Мангистауской области (Гражданские дела (ч.1 ст.27 ГПК))": "284",
            "Жанаозенский городской суд (Общая юрисдикция)": "286",
            "Бейнеуский районный суд Мангистауской области (Общая юрисдикция)": "288",
            "Каракиянский районный суд Мангистауской области (Общая юрисдикция)": "289",
            "Мангистауский районный суд Мангистауской области (Общая юрисдикция)": "290",
            "Тупкараганский районный суд Мангистауской области (Общая юрисдикция)": "291",
            "Мунайлинский районный суд Мангистауской области (Общая юрисдикция)": "292",
            "Специализированный межрайонный суд по делам несовершеннолетних Мангистауской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "293"
        }
    },
    "Павлодарская область": {
        "value": "15",
        "sudebnieOrgany": {
            "Специализированный межрайонный экономический суд Павлодарской области (Гражданские дела (ч.1 ст.27 ГПК))": "296",
            "Межрайонный суд по гражданским делам города Павлодара": "297",
            "Межрайонный суд города Аксу Павлодарской области": "300",
            "Экибастузский городской суд Павлодарской области (Общая юрисдикция)": "302",
            "Актогайский районный суд Павлодарской области (Общая юрисдикция)": "304",
            "Баянаульский районный суд Павлодарской области (Общая юрисдикция)": "305",
            "Железинский районный суд Павлодарской области (Общая юрисдикция)": "306",
            "Иртышский районный суд Павлодарской области (Общая юрисдикция)": "307",
            "Суд района Тереңкөл Павлодарской области (Общая юрисдикция)": "308",
            "Суд района Аққулы Павлодарской области (Общая юрисдикция)": "309",
            "Успенский районный суд Павлодарской области (Общая юрисдикция)": "312",
            "Щербактинский районный суд Павлодарской области (Общая юрисдикция)": "313",
            "Специализированный межрайонный суд по делам несовершеннолетних Павлодарской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП)": "314"
        }
    },
    "Северо-Казахстанская область": {
        "value": "16",
        "sudebnieOrgany": {
            "Суд №2 города Петропавловска Северо-Казахстанской области (Гражданские дела)": "318",
            "Специализированный межрайонный экономический суд Северо-Казахстанской области (Гражданские дела (ч.1 ст.27 ГПК))": "320",
            "Айыртауский районный суд Северо-Казахстанской области (Общая юрисдикция)": "321",
            "Акжарский районный суд Северо-Казахстанской области (Общая юрисдикция)": "323",
            "Суд района имени Магжана Жумабаева Северо-Казахстанской области (Общая юрисдикция)": "324",
            "Есильский районный суд Северо-Казахстанской области (Общая юрисдикция)": "325",
            "Жамбылский районный суд Северо-Казахстанской области (Общая юрисдикция)": "326",
            "Кызылжарский районный суд Северо-Казахстанской области (Общая юрисдикция)": "327",
            "Мамлютский районый суд Северо-Казахстанской области (Общая юрисдикция)": "328",
            "Межрайонный суд района  Шал акына Северо-Казахстанской области ": "329",
            "Аккайынский районный суд Северо-Казахстанской области (Общая юрисдикция)": "330",
            "Тайыншинский районный суд Северо-Казахстанской области (Общая юрисдикция)": "331",
            "Уалихановский районный суд Северо-Казахстанской области (Общая юрисдикция)": "335",
            "Суд района имени Габита Мусрепова Северо-Казахстанской области (Общая юрисдикция)": "336",
            "Специализированный межрайонный суд по делам несовершеннолетних Северо-Казахстанской области (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП))": "338",
        }
    },
    "Туркестанская область": {
        "value": "17",
        "sudebnieOrgany": {
            "Арысский районный суд Туркестанской области (Общая юрисдикция)": "345",
            "Кентауский городской суд Туркестанской области (Общая юрисдикция)": "346",
            "Межрайонный суд города Туркестана": "347",
            "Байдибекский районный суд Туркестанской области (Общая юрисдикция)": "348",
            "Казыгуртский районный суд Туркестанской области (Общая юрисдикция)": "349",
            "Мактааральский районный суд Туркестанской области (Общая юрисдикция)": "350",
            "Жетысайский районный суд Туркестанской области (Общая юрисдикция)": "351",
            "Ордабасинский районный суд  Туркестанской области (Общая юрисдикция)": "353",
            "Отрарский районный суд Туркестанской области (Общая юрисдикция)": "354",
            "Сайрамский районный суд Туркестанской области (Общая юрисдикция)": "355",
            "Сарыагашский районный суд Туркестанской области (Гражданские, уголовные дела)": "357",
            "Келесский районный суд Туркестанской области (Общая юрисдикция)": "358",
            "Сузакский районный суд Туркестанской области (Общая юрисдикция)": "359",
            "Толебийский районный суд Туркестанской области (Общая юрисдикция)": "360",
            "Тюлькубаский районный суд Туркестанской области (Общая юрисдикция)": "361",
            "Шардаринский районный суд Туркестанской области (Общая юрисдикция)": "362",
            "Специализированный межрайонный экономический суд Туркестанской области (Гражданские дела (ч.1 ст.27 ГПК)": "363",
            "Специализированный межрайонный суд по делам несовершеннолетних Туркестанской области  (Гражданские, уголовные, административные дела (ч.3 ст.27 ГПК, ст.307 УПК, ст.682 КРКоАП)": "364"
        }
    },
    "Военный суд Республики Казахстан": {
        "value": "18",
        "sudebnieOrgany": {
            "Военный суд Алматинского гарнизона (Гражданские, уголовные дела (ч.2 ст.27 ГПК, ст.309 УПК)": "367",
            "Военный суд Акмолинского гарнизона (Гражданские, уголовные дела (ч.2 ст.27 ГПК, ст.309 УПК)": "368",
            "Военный суд Семейского гарнизона (Гражданские, уголовные дела (ч.2 ст.27 ГПК, ст.309 УПК)": "370",
            "Военный суд Актюбинского гарнизона (Гражданские, уголовные дела (ч.2 ст.27 ГПК, ст.309 УПК)": "374",
            "Военный суд Шымкентского гарнизона (Гражданские, уголовные дела (ч.2 ст.27 ГПК, ст.309 УПК)": "376"
        }
    },
    "Область Ұлытау": {
        "value": "20",
        "sudebnieOrgany": {
            "Жезказганский городской суд области Ұлытау": "478",
            "Специализированный межрайонный экономический суд области Ұлытау": "485",
            "Каражалский городской суд области Ұлытау": "479",
            "Сатпаевский городской суд области Ұлытау": "480",
            "Жанааркинский районный суд области Ұлытау": "477",
            "Улытауский районный суд области Ұлытау": "481",
            "Специализированный межрайонный суд по делам несовершеннолетних области Ұлытау": "483"
        }
    },
    "Область Абай": {
        "value": "21",
        "sudebnieOrgany": {
            "Межрайонный суд по гражданским делам  города Семея": "128",
            "Специализированный межрайонный экономический суд области Абай": "474",
            "Курчатовский городской суд области Абай": "463",
            "Абайский районный суд области Абай": "457",
            "Суд района Ақсуат области Абай": "471",
            "Аягозский районный суд области Абай": "458",
            "Бескарагайский районный суд области Абай": "459",
            "Бородулихинский районный суд области Абай": "460",
            "Жарминский районный суд области Абай": "461",
            "Кокпектинский районный суд области Абай": "462",
            "Урджарский районный суд области Абай": "472",
            "Суд района Мақаншы": "153",
            "Специализированный межрайонный суд по делам несовершеннолетних  области Абай": "469"
        }
    },
    "Область Жетісу": {
        "value": "22",
        "sudebnieOrgany": {
            "Талдыкорганский городской суд области  Жетісу": "448",
            "Специализированный межрайонный экономический суд области Жетісу": "454",
            "Текелийский городской суд области Жетісу": "449",
            "Аксуский районный суд области Жетісу": "438",
            "Районный суд № 2 Алакольского района области  Жетісу": "445",
            "Алакольский районный суд области Жетісу": "439",
            "Ескельдинский районный суд области Жетісу": "440",
            "Кербулакский районный суд области Жетісу": "442",
            "Коксуский районный суд области Жетісу": "443",
            "Каратальский районный суд области Жетісу": "441",
            "Панфиловский районный суд области Жетісу": "444",
            "Сарканский районный суд области Жетісу": "447",
            "Специализированный межрайонный суд по делам несовершеннолетних области Жетісу": "451"
        }
    },
    "Упразднённые суды (c 2022 года)": {
        "value": "99",
        "sudebnieOrgany": {
            "Алматинский районный суд города Астаны (Гражданские дела)": "3",
            "Сарыаркинский районный суд города Астаны (Гражданские дела)": "4",
            "Есильский районный суд города Астаны (Гражданские дела)": "11",
            "Суд района «Байқоңыр» города Астаны (Гражданские дела)": "390"
        }
    }
}

def getPodsudnostValue(podsudnost: str)->dict:
    for oblast in oblastMap:
        for sud in oblastMap[oblast]['sudebnieOrgany']:
            if podsudnost in sud:
                return {
                    "sudValue": oblastMap[oblast]['sudebnieOrgany'][sud],
                    "oblastValue": oblastMap[oblast]['value'],
                    'sudName': podsudnost,
                }

    return {
       "sudValue": None,
       "oblastValue": None,
       'sudName': None
    }
